scraper_ops/app/models/scraper.rb

    def publish!
      transaction do
        opening.lock.each do |scraper|
          scraper.update(state: :processing)
---
UPDATE "scrapers" SET "state" = $1, "updated_at" = $2 WHERE "scrapers"."id" = $3  [["state", 1], ["updated_at", "2023-07-26 08:28:48.419441"], ["id", 3]]