scraper_ops/app/controllers/scrapers_controller.rb

  def index
    @scrapers = Scraper.all
---
SELECT "scrapers".* FROM "scrapers"

  def show
    @scraper = Scraper.find(params[:id])
---
SELECT "scrapers".* FROM "scrapers" WHERE "scrapers"."id" = $1 LIMIT $2  [["id", 24], ["LIMIT", 1]]

  def create
    url = params[:url]

    @scraper = Scraper.new(url: url)

    if @scraper.save
---
INSERT INTO "scrapers" ("url", "state", "status", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["url", "http://example_26.com"], ["state", 0], ["status", nil], ["created_at", "2023-07-26 11:33:27.431083"], ["updated_at", "2023-07-26 11:33:27.431083"]]